# 条件查询

In [2]:
data = {
    'name': ['Bob', 'Lindy', 'Mark', 'Miki', 'Sully', 'Rose'],
    'score': [98, 78, 87, 77, 65, 67],
    'group': [1, 1, 1, 2, 1, 2]
}

In [4]:
sample = pd.DataFrame(data)
sample

    name  score  group
0    Bob     98      1
1  Lindy     78      1
2   Mark     87      1
3   Miki     77      2
4  Sully     65      1
5   Rose     67      2

## 单条件

In [6]:
sample.score > 70

0     True
1     True
2     True
3     True
4    False
5    False
Name: score, dtype: bool

In [5]:
sample[sample.score > 70]

    name  score  group
0    Bob     98      1
1  Lindy     78      1
2   Mark     87      1
3   Miki     77      2

## 多条件

<span class="burk">使用布尔运算符 `&` 、`|` 和 `~` 作为连接符</span>。

In [9]:
(sample.score > 70) & (sample.group ==1)

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [10]:
sample[(sample.score > 70) & (sample.group ==1)]

    name  score  group
0    Bob     98      1
1  Lindy     78      1
2   Mark     87      1

## 使用 query

查询条件是字符串。

In [12]:
sample.query('score > 90')

  name  score  group
0  Bob     98      1

In [13]:
sample.query('(group ==2) |(group == 1)')

    name  score  group
0    Bob     98      1
1  Lindy     78      1
2   Mark     87      1
3   Miki     77      2
4  Sully     65      1
5   Rose     67      2

## 其他：between 、in、contains

In [14]:
sample[sample['score'].between(70, 80, inclusive=True)]

    name  score  group
1  Lindy     78      1
3   Miki     77      2

In [15]:
sample[sample['name'].isin(['Bob', 'Lindy'])]

    name  score  group
0    Bob     98      1
1  Lindy     78      1

### 字符串处理、使用正则表达式

In [16]:
sample[sample['name'].str.contains('[M]+')]

   name  score  group
2  Mark     87      1
3  Miki     77      2